import streamlit as st
from datetime import datetime, timedelta
import re
import base64

# ----------------------
# 유틸
# ----------------------
def add_space(text: str) -> str:
    return re.sub(r"([가-힣A-Za-z]+)(\d+)", r"\1 \2", text)

def to_million(v: float) -> str:
    if v >= 1000:
        return f"{v/1000:.1f}G" if v % 1000 else f"{v//1000}G"
    return f"{v}M" if v >= 1 else f"{v*1000:.0f}K"

def format_time(d, h, m, s):
    return f"{d}D {h:02}:{m:02}:{s:02}"

# ----------------------
# 페이지 설정
# ----------------------
st.set_page_config(
    page_title="Last War 건설 시간 계산기",
    page_icon="lastwarg.png",
    layout="centered"
)

# 이미지와 제목을 같은 줄, 수직 가운데 정렬, 간격 최소화
col1, col2 = st.columns([1, 8])

with col1:
    st.image("lastwarg.png", width=55, output_format="auto")

with col2:
    st.markdown(
        """
        <div style='display:flex; align-items:center; height:100%;'>
            <h2 style='margin:0; padding-left:0px;'>Last War 건설 시간 계산기</h2>
        </div>
        """,
        unsafe_allow_html=True
    )

st.caption("건물 업그레이드 시간 · 자원 · 완료 시각 계산")
st.divider()



# ----------------------
# 데이터
# ----------------------
BUILDING_DATA = {
    "본부(Headquarters)": {
        "10 → 11": {"time": (0, 7,22,55), "res": (1.9,1.9,0.6), "req": ("과학센터10","베리어10")},
        "11 → 12": {"time": (0, 9,35,48), "res": (3.2,3.2,1.0), "req": ("과학센터11","병영11")},
        "12 → 13": {"time": (0,12,28,32), "res": (3.5,3.5,1.1), "req": ("과학센터12","탱크센터12")},
        "13 → 14": {"time": (0,16,13,6), "res": (4.9,4.9,1.6), "req": ("과학센터13","연병장13")},
        "14 → 15": {"time": (0,22,42,20), "res": (6.8,6.8,2.2), "req": ("과학센터14","베리어14")},
        "15 → 16": {"time": (1,7,47,15), "res": (12,12,3.9), "req": ("과학센터15","연맹센터15")},
        "16 → 17": {"time": (1,20,30,9), "res": (16,16,5.1), "req": ("과학센터16","탱크센터16")},
        "17 → 18": {"time": (2,1,18,13), "res": (28,28,8.9), "req": ("과학센터17","병원17")},
        "18 → 19": {"time": (3,15,13,29), "res": (33,33,11), "req": ("과학센터18","베리어18")},
        "19 → 20": {"time": (5,2,6,53), "res": (60,60,19), "req": ("과학센터19","병영19")},
        "20 → 21": {"time": (6,14,44,57), "res": (84,84,27), "req": ("과학센터20","탱크센터20")},
        "21 → 22": {"time": (8,14,22,26), "res": (110,110,35), "req": ("과학센터21","연병장21")},
        "22 → 23": {"time": (11,4,17,9), "res": (140,140,44), "req": ("과학센터22","베리어22")},
        "23 → 24": {"time": (15,15,36,1), "res": (170,170,54), "req": ("과학센터23","연맹센터23")},
        "24 → 25": {"time": (21,21,50,25),"res": (290,290,93), "req": ("과학센터24","탱크센터24")},
        "25 → 26": {"time": (30,16,10,35),"res": (400,400,130),"req": ("과학센터25","병원25")},
        "26 → 27": {"time": (42,22,38,49),"res": (530,530,170),"req": ("과학센터26","베리어26")},
        "27 → 28": {"time": (60,2,54,20),"res": (740,740,240),"req": ("과학센터27","병영27")},
        "28 → 29": {"time": (78,3,46,37),"res": (1000,1000,330),"req": ("과학센터28","탱크센터28")},
        "29 → 30": {"time": (101,14,30,37),"res": (1400,1400,460),"req": ("과학센터29","연병장29")},
    },
    "제1테크센터(Tech Center)": {
        "10 → 11": {"time": (0,6,30,0), "res": (1.6,1.6,0.52)},
        "11 → 12": {"time": (0,8,23,49), "res": (2.8,2.8,0.89)},
        "12 → 13": {"time": (0,10,54,58), "res": (3.1,3.1,0.98)},
        "13 → 14": {"time": (0,14,11,27), "res": (4.3,4.3,1.4)},
        "14 → 15": {"time": (0,19,52,2), "res": (6,6,1.9)},
        "15 → 16": {"time": (1,3,48,51), "res": (11,11,3.4)},
        "16 → 17": {"time": (1,14,56,23), "res": (14,14,4.4)},
        "17 → 18": {"time": (2,6,30,56), "res": (24,24,7.8)},
        "18 → 19": {"time": (3,4,19,18), "res": (29,29,9.3)},
        "19 → 20": {"time": (4,10,51,2), "res": (52,52,17)},
        "20 → 21": {"time": (5,18,54,20), "res": (73,73,23)},
        "21 → 22": {"time": (7,12,34,38), "res": (95,95,30)},
        "22 → 23": {"time": (9,18,45,1), "res": (120,120,38)},
        "23 → 24": {"time": (13,16,39,1), "res": (150,150,48)},
        "24 → 25": {"time": (19,4,6,37), "res": (250,250,81)},
        "25 → 26": {"time": (26,20,9,16), "res": (350,350,110)},
        "26 → 27": {"time": (37,13,48,58), "res": (460,460,150)},
        "27 → 28": {"time": (52,14,32,32), "res": (640,640,210)},
        "28 → 29": {"time": (68,9,18,18), "res": (900,900,290)},
        "29 → 30": {"time": (88,21,41,47), "res": (1300,1300,400)},
    },
"탱크/전투기/미사일 센터(Tank Center)": {
    "10 → 11": {"time": (0,5,32,12), "res": (1.4,0.47,0.3)},
    "11 → 12": {"time": (0,7,11,51), "res": (2.4,0.79,0.51)},
    "12 → 13": {"time": (0,9,21,24), "res": (2.6,0.87,0.56)},
    "13 → 14": {"time": (0,12,9,49), "res": (3.7,1.2,0.78)},
    "14 → 15": {"time": (0,17,1,45), "res": (5.1,1.7,1.1)},
    "15 → 16": {"time": (0,23,50,27), "res": (9.1,3,1.9)},
    "16 → 17": {"time": (1,9,22,37), "res": (12,4,2.5)},
    "17 → 18": {"time": (1,22,43,40), "res": (21,6.9,4.4)},
    "18 → 19": {"time": (2,17,25,7), "res": (25,8.3,5.3)},
    "19 → 20": {"time": (3,19,35,10), "res": (45,15,9.6)},
    "20 → 21": {"time": (4,23,3,43), "res": (63,21,13)},
    "21 → 22": {"time": (6,10,46,49), "res": (82,27,17)},
    "22 → 23": {"time": (8,9,12,52), "res": (100,34,22)},
    "23 → 24": {"time": (11,17,42,1), "res": (130,43,27)},
    "24 → 25": {"time": (16,10,22,49), "res": (220,72,46)},
    "25 → 26": {"time": (23,0,7,56), "res": (300,100,65)},
    "26 → 27": {"time": (32,4,59,7), "res": (390,130,84)},
    "27 → 28": {"time": (45,2,10,45), "res": (550,180,120)},
    "28 → 29": {"time": (58,14,49,58), "res": (770,260,170)},
    "29 → 30": {"time": (76,4,52,58), "res": (1100,360,230)},
},
"병영(Barracks)": {
    "10 → 11": {"time": (0,5,32,12), "res": (0.93,0.93,0.37)},
    "11 → 12": {"time": (0,7,11,51), "res": (1.6,1.6,0.63)},
    "12 → 13": {"time": (0,9,21,24), "res": (1.7,1.7,0.7)},
    "13 → 14": {"time": (0,12,9,49), "res": (2.4,2.4,0.98)},
    "14 → 15": {"time": (0,17,1,45), "res": (3.4,3.4,1.4)},
    "15 → 16": {"time": (0,23,50,27), "res": (6.1,6.1,2.4)},
    "16 → 17": {"time": (1,9,22,37), "res": (7.9,7.9,3.2)},
    "17 → 18": {"time": (1,22,43,40), "res": (14,14,5.5)},
    "18 → 19": {"time": (2,17,25,7), "res": (17,17,6.6)},
    "19 → 20": {"time": (3,19,35,10), "res": (30,30,12)},
    "20 → 21": {"time": (4,23,3,43), "res": (42,42,17)},
    "21 → 22": {"time": (6,10,46,49), "res": (54,54,22)},
    "22 → 23": {"time": (8,9,12,52), "res": (68,68,27)},
    "23 → 24": {"time": (11,17,42,1), "res": (85,85,34)},
    "24 → 25": {"time": (16,10,22,49), "res": (140,140,58)},
    "25 → 26": {"time": (23,0,7,56), "res": (200,200,81)},
    "26 → 27": {"time": (32,4,59,7), "res": (260,260,110)},
    "27 → 28": {"time": (45,2,10,45), "res": (370,370,150)},
    "28 → 29": {"time": (58,14,49,58), "res": (520,520,210)},
    "29 → 30": {"time": (76,4,52,58), "res": (720,720,290)},
},
    "연병장(Drill Groound)": {
    "10 → 11": {"time": (0,3,41,28), "res": (0.31, 0.93, 0.25)},
    "11 → 12": {"time": (0,4,47,54), "res": (0.53, 1.6, 0.42)},
    "12 → 13": {"time": (0,6,14,16), "res": (0.58, 1.7, 0.47)},
    "13 → 14": {"time": (0,8,6,33), "res": (0.81, 2.4, 0.65)},
    "14 → 15": {"time": (0,11,21,10), "res": (1.1, 3.4, 0.91)},
    "15 → 16": {"time": (0,15,53,38), "res": (2.0, 6.1, 1.6)},
    "16 → 17": {"time": (0,22,15,5), "res": (2.6, 7.9, 2.1)},
    "17 → 18": {"time": (1,7,9,7), "res": (4.6, 14, 3.7)},
    "18 → 19": {"time": (1,19,36,45), "res": (5.5, 17, 4.4)},
    "19 → 20": {"time": (2,13,3,27), "res": (10, 30, 8)},
    "20 → 21": {"time": (3,7,22,29), "res": (14, 42, 11)},
    "21 → 22": {"time": (4,7,11,13), "res": (18, 54, 15)},
    "22 → 23": {"time": (5,14,21,55), "res": (23, 68, 18)},
    "23 → 24": {"time": (7,16,1,21), "res": (28, 85, 23)},
    "24 → 25": {"time": (10,19,55,13), "res": (48, 140, 39)},
    "25 → 26": {"time": (15,8,31,58), "res": (67, 200, 54)},
    "26 → 27": {"time": (21,12,32,45), "res": (88, 260, 70)},
    "27 → 28": {"time": (30,1,33,50), "res": (120, 370, 98)},
    "28 → 29": {"time": (39,1,53,19), "res": (170, 520, 140)},
    "29 → 30": {"time": (50,19,15,19), "res": (240, 720, 190)},
},
"연맹지원센터(Alliance Center)": {
    "10 → 11": {"time": (0,3,41,28), "res": (0.31,0.93,0.3)},
    "11 → 12": {"time": (0,4,47,54), "res": (0.53,1.6,0.51)},
    "12 → 13": {"time": (0,6,14,16), "res": (0.58,1.7,0.56)},
    "13 → 14": {"time": (0,8,6,33), "res": (0.81,2.4,0.78)},
    "14 → 15": {"time": (0,11,21,10), "res": (1.1,3.4,1.1)},
    "15 → 16": {"time": (0,15,53,38), "res": (2,6.1,1.9)},
    "16 → 17": {"time": (0,22,15,5), "res": (2.6,7.9,2.5)},
    "17 → 18": {"time": (1,7,9,7), "res": (4.6,14,4.4)},
    "18 → 19": {"time": (1,19,36,45), "res": (5.5,17,5.3)},
    "19 → 20": {"time": (2,13,3,27), "res": (10,30,9.6)},
    "20 → 21": {"time": (3,7,22,29), "res": (14,42,13)},
    "21 → 22": {"time": (4,7,11,13), "res": (18,54,17)},
    "22 → 23": {"time": (5,14,8,35), "res": (23,68,22)},
    "23 → 24": {"time": (7,19,48,1), "res": (28,85,27)},
    "24 → 25": {"time": (10,22,55,13), "res": (48,140,46)},
    "25 → 26": {"time": (15,8,5,18), "res": (67,200,65)},
    "26 → 27": {"time": (21,11,19,25), "res": (88,260,84)},
    "27 → 28": {"time": (30,1,27,10), "res": (120,370,120)},
    "28 → 29": {"time": (39,1,53,19), "res": (170,520,170)},
    "29 → 30": {"time": (50,19,15,19), "res": (240,720,230)},
},
    "병원(Hospital)": {
    "10 → 11": {"time": (0,5,32,12), "res": (0.47,1.4,0.37)},
    "11 → 12": {"time": (0,7,11,51), "res": (0.79,2.4,0.63)},
    "12 → 13": {"time": (0,9,21,24), "res": (0.87,2.6,0.7)},
    "13 → 14": {"time": (0,12,9,49), "res": (1.2,3.7,0.98)},
    "14 → 15": {"time": (0,17,1,45), "res": (1.7,5.1,1.4)},
    "15 → 16": {"time": (0,23,50,27), "res": (3,9.1,2.4)},
    "16 → 17": {"time": (1,9,22,37), "res": (4,12,3.2)},
    "17 → 18": {"time": (1,22,43,40), "res": (6.9,21,5.5)},
    "18 → 19": {"time": (2,17,25,7), "res": (8.3,25,6.6)},
    "19 → 20": {"time": (3,19,35,10), "res": (15,45,12)},
    "20 → 21": {"time": (4,23,3,43), "res": (21,63,17)},
    "21 → 22": {"time": (6,10,46,49), "res": (27,82,22)},
    "22 → 23": {"time": (8,9,12,52), "res": (34,100,27)},
    "23 → 24": {"time": (11,17,42,1), "res": (43,130,34)},
    "24 → 25": {"time": (16,10,22,49), "res": (72,220,58)},
    "25 → 26": {"time": (23,0,7,56), "res": (100,300,81)},
    "26 → 27": {"time": (32,4,59,7), "res": (130,390,110)},
    "27 → 28": {"time": (45,2,10,45), "res": (180,550,150)},
    "28 → 29": {"time": (58,14,49,58), "res": (260,770,210)},
    "29 → 30": {"time": (76,4,52,58), "res": (360,1100,290)},
},
   "베리어(Wall)": {
    "10 → 11": {"time": (0,7,22,55), "res": (1.9, 0.62, 0.4)},
    "11 → 12": {"time": (0,9,35,48), "res": (3.2, 1.1, 0.68)},
    "12 → 13": {"time": (0,12,28,32), "res": (3.5, 1.2, 0.74)},
    "13 → 14": {"time": (0,16,13,6), "res": (4.9, 1.6, 1.0)},
    "14 → 15": {"time": (0,22,42,20), "res": (6.8, 2.3, 1.5)},
    "15 → 16": {"time": (1,7,47,15), "res": (12, 4.1, 2.6)},
    "16 → 17": {"time": (1,20,30,9), "res": (16, 5.3, 3.4)},
    "17 → 18": {"time": (2,1,18,13), "res": (28, 9.2, 5.9)},
    "18 → 19": {"time": (3,15,13,29), "res": (33, 11, 7.1)},
    "19 → 20": {"time": (5,2,6,53), "res": (60, 20, 13)},
    "20 → 21": {"time": (6,14,44,57), "res": (84, 28, 18)},
    "21 → 22": {"time": (8,14,22,26), "res": (110, 36, 23)},
    "22 → 23": {"time": (11,4,17,9), "res": (140, 45, 29)},
    "23 → 24": {"time": (15,15,36,1), "res": (170, 57, 36)},
    "24 → 25": {"time": (21,21,50,25), "res": (290, 96, 62)},
    "25 → 26": {"time": (30,16,10,35), "res": (400, 130, 86)},
    "26 → 27": {"time": (42,22,38,49), "res": (530, 180, 110)},
    "27 → 28": {"time": (60,2,54,20), "res": (740, 250, 160)},
    "28 → 29": {"time": (78,3,46,37), "res": (1000, 340, 220)},  # 1g → 1000M
    "29 → 30": {"time": (101,14,30,37), "res": (1400, 480, 310)},  # 1.4g → 1400M
},
}

# ----------------------
# 건물 / 레벨 선택 (좌우 배치)
# ----------------------
st.markdown("""
<style>
[data-baseweb="select"] { margin-top: 0px !important; margin-bottom: 0px !important; }
.element-container { padding-bottom: 0rem !important; }
</style>
""", unsafe_allow_html=True)

col_building, col_level = st.columns(2)

with col_building:
    st.markdown(
        "<p style='font-size:25px; font-weight:bold; margin:3px;'>🛠️ 건물 선택</p>",
        unsafe_allow_html=True
    )
    building = st.selectbox(
        "",
        BUILDING_DATA.keys(),
        key="building",
        label_visibility="collapsed"
    )

with col_level:
    st.markdown(
        "<p style='font-size:25px; font-weight:bold; margin:3px;'>𝑳𝐕 레벨 구간</p>",
        unsafe_allow_html=True
    )
    level = st.selectbox(
        "",
        list(BUILDING_DATA[building].keys())[::-1],
        key="level",
        label_visibility="collapsed"
    )

data = BUILDING_DATA[building][level]
d, h, m, s = data["time"]



# ----------------------
# 자원 / 요구조건
# ----------------------
iron, food, gold = data["res"]
reqs = data.get("req", []) if "req" in data else []

st.divider()
col_res, col_req = st.columns([3,2])

with col_res:
    st.subheader("📦 필요 자원")
    r1,r2,r3 = st.columns(3)
    with r1:
        st.image("iron.png", width=40)
        st.markdown(to_million(iron))
    with r2:
        st.image("food.png", width=40)
        st.markdown(to_million(food))
    with r3:
        st.image("gold.png", width=40)
        st.markdown(to_million(gold))

if reqs:
    with col_req:
        st.subheader("📌 요구 조건")
        for r in reqs:
            st.markdown(f"- {add_space(r)}")


# ----------------------
# 가속 계산
# ----------------------
st.divider()
st.subheader("⚡ 건설 가속")

# 문구 칸 추가 (비워둠, 나중에 내용 입력 가능)
st.markdown("<p style='font-size:14px; color:gray; margin-bottom:5px;'>* 나의 건설 속도는 [기지 → 통계 → 경제탭에서 건설건물속도증가 % 확인]</p>", unsafe_allow_html=True)

col_speed, col_mayor = st.columns(2)

with col_speed:
    st.markdown("<p style='font-size:20px; font-weight:bold; margin:3px;'>나의 건설 속도</p>", unsafe_allow_html=True)
    my_speed = st.number_input("", 0.0, 500.0, 0.0, 0.1, label_visibility="collapsed")

with col_mayor:
    st.markdown("<p style='font-size:20px; font-weight:bold; margin:3px;'>장관 가속</p>", unsafe_allow_html=True)
    mayor = st.selectbox(
        "",
        ["건설장관 50%", "과학부장 25%"],
        index=0,  # 기본값: 건설장관 50%
        key="mayor_select",
        label_visibility="collapsed"
    )


if st.button("🚀 계산하기", use_container_width=True):
    base_sec = d*86400 + h*3600 + m*60 + s
    final_sec = base_sec / (1 + (my_speed + mayor)/100)
    dur = timedelta(seconds=int(final_sec))
    end_time = datetime.now() + dur

    col1,col2 = st.columns(2)
    with col1:
        st.metric("⏱️ 기본 건설 시간", format_time(d,h,m,s))
    with col2:
        st.metric("⚡ 최종 건설 시간", f"{dur.days}D {dur.seconds//3600:02}:{(dur.seconds%3600)//60:02}:{dur.seconds%60:02}")

    st.metric("📅 완료 예정 시각", end_time.strftime("%Y-%m-%d %H:%M:%S"))


























































